{"meta":{"title":"Joy's IT Blog","subtitle":"Joy's IT Blog","description":null,"author":"Joy Hur","url":"http://jsoftdev.github.io"},"pages":[],"posts":[{"title":"LSS Update 2018_01_02","slug":"LSS-Update-2018-01-02","date":"2018-01-02T11:43:30.000Z","updated":"2018-01-02T12:50:22.687Z","comments":true,"path":"2018/01/02/LSS-Update-2018-01-02/","link":"","permalink":"http://jsoftdev.github.io/2018/01/02/LSS-Update-2018-01-02/","excerpt":"","text":"2018년 1월 2일자 업데이트 이미지 파일에 LSS를 연결해서 일반 이미지 뷰어처럼 사용할 수 있습니다. - 특정 이미지를 요구하는 연사나 공개강연 강사를 위해서 사용할 수 있습니다. 이미지 파일에 LSS를 연결한 후 이미지를 더블클릭하면 그 이미지가 바로 TV에 보여지게 됩니다. 그런 다음 일반 이미지 뷰어를 사용하듯이 자동으로 실행되는 이미지 컨트롤러를 실행하시면 됩니다. 아래의 동영상을 참고하세요. 프로그램 경로에 영어나 숫자 외의 다른 문자가 들어가면 실행되지 않았던 버그가 수정되었습니다. 참고로 연표어 기능을 사용하고 싶지 않다면 루트 폴더의 연표어 이미지를 삭제하시면 됩니다. 업데이트를 다운받고 싶다면 이 링크에서 받을 수 있습니다. Download LSS 2018-01-02 Update 다운 후 기존 프로그램에 덮어쓰면 됩니다. 풀버전을 받고 싶다면 이 링크에서 받을 수 있습니다. Download LSS 2018-01-02 Full.Ver.압축 해제 후 원하는 위치에 복사해서 사용하세요. 윈도우7의 경우 .Net Framework 4.5 이상을 설치하시면 됩니다. 동영상 재생을 위해서 다음 팟플레이어가 포터블로 포함되어 있습니다.","categories":[{"name":"LSS","slug":"LSS","permalink":"http://jsoftdev.github.io/categories/LSS/"}],"tags":[{"name":"lss","slug":"lss","permalink":"http://jsoftdev.github.io/tags/lss/"},{"name":"update","slug":"update","permalink":"http://jsoftdev.github.io/tags/update/"}]},{"title":"Local Studio System (LSS)","slug":"Local-Studio-System-Intro","date":"2017-12-30T14:21:47.000Z","updated":"2018-01-02T12:51:37.769Z","comments":true,"path":"2017/12/30/Local-Studio-System-Intro/","link":"","permalink":"http://jsoftdev.github.io/2017/12/30/Local-Studio-System-Intro/","excerpt":"","text":"LSS 설명 LSS는 Local Studio System의 약자입니다. 주요 사용 용도는 회중 집회 때 TV에 이미지, 동영상, 노래 재생 그리고 주제 및 연사 소개 등을 쉽게 프리젠테이션할 수 있는 프로그램입니다.일부 지역에서 유용하게 사용했던 KSS프로그램의 녹화 지원 기능을 빼고 프리젠테이션 기능을 좀 더 편하게 사용하도록 개선한 버전입니다. 수화 회중에서 사용한다면 LSS보다는 KSS를 사용하는 것이 좋겠지요. 물론 회중 집회 외에도 간단한 프리젠테이션 용도로 사용할 수 있습니다. 단순히 몇 개의 이미지나 동영상 그리고 제목 정도 출력한다면 MS파워포인트 보다는 훨씬 쉽고 빠르게 준비할 수 있습니다. JW Library가 있는데도 LSS가 필요합니까? JW Library가 업데이트 되면서 집회 때 프리젠테이션 기능이 점점 강화되어서 기쁨니다. JW Library가 더욱 기능이 강화되어 LSS가 필요없는 때가 오기를 기대합니다. 현재로서는 JW Library가 지원하지 못하는 상황이 있습니다. 예를 들어, 최근에도 말라기 소개 동영상은 업데이트가 늦어져서 별도의 앱으로 동영상을 재생해야 하는 경우가 있었고 연사들이 JW Library에는 없는 이미지를 화면에 출력해 주기를 원하는 경우가 있습니다. 특히 공개강연 연사는 자신의 강연에 맞게 프리젠테이션용 이미지를 준비해 오는 경우가 많습니다. 그런 경우 JW Library외에 다른 프로그램을 사용할 수 밖에 없습니다. 그러한 상황에서 LSS는 별다른 학습없이 바로 사용할 수 있습니다. 회중 상황에 맞게 전체 기능을 사용할 수도 있고 단순히 동영상 재생과 이미지 프리젠테이션 용도로만 사용할 수도 있습니다. 블로그에서 관리 LSS를 만들어 사용한지 3년이 넘어가네요. 그동안 변화하는 집회 환경에 맞추어서 계속 업데이트를 하고 있었는데, 사용하시는 분들에게 별도로 연락 드리는 것보다 블로그에서 관리하는 것이 좋을 듯 싶어 블로그를 만들어서 운영하고자 합니다. 풀버전을 받고 싶다면 이 링크에서 받을 수 있습니다. Download LSS 2018-01-02 Full.Ver.압축 해제 후 원하는 위치에 복사해서 사용하세요. 윈도우7의 경우 .Net Framework 4.5 이상을 설치하시면 됩니다. 동영상 재생을 위해서 다음 팟플레이어가 포터블로 포함되어 있습니다. 사용방법 동영상","categories":[{"name":"LSS","slug":"LSS","permalink":"http://jsoftdev.github.io/categories/LSS/"}],"tags":[{"name":"lss","slug":"lss","permalink":"http://jsoftdev.github.io/tags/lss/"}]},{"title":"About","slug":"About","date":"2017-12-30T14:21:47.000Z","updated":"2018-01-02T10:49:39.156Z","comments":true,"path":"2017/12/30/About/","link":"","permalink":"http://jsoftdev.github.io/2017/12/30/About/","excerpt":"","text":"Joy Hur 개인적으로 프로그래밍을 공부한지 20년이 넘어 갑니다. C# 으로 데스크톱 어플을 주로 제작합니다. 대부분 RBC, 순회구, 회중일을 하면서 비공식적으로 부탁받은 프로그램들을 제작해 왔습니다. 중국어쪽에서 활동한지 10년이 되었네요. 지금은 말레이시아 코타키나발루에 있습니다. 코타키나발루에서의 생활 1년 전까지는 동북쪽에 있어서 너무 추웠어요. 한겨울에는 -30℃까지 떨어져서 7년간 동북쪽 생활하니 저희 부부의 건강이 안 좋아졌어요. 6년째는 교통사고도 났었구요. 말레이에 관한 정보는 전혀 없이, 중국어 회중이 있는 열대 지역에 요양차 가고싶어서 왔는데 자연환경도 좋고 사람들이 너무 밝고 친절해서 좋네요. 중국어 회중에서 1년정도 있다가 지금은 말레이시아 구역이 좋아서 말레이어 회중으로 옮겼어요. 말레이어 공부도 시작했어요. 중국어 회중도 좋았지만 말레이어 회중에서는 청소년들과 아이들이 많아서 좋네요. 너무 예뻐요. ^^ 일몰듣기론 KK에서는 세계 3대 안에 드는 아름다운 석양을 볼 수 있다고 하네요. 아래의 사진은 싸구려 폰카로 찍은건데도 잘 나온거 같아요. 말레이어 봉사 말레이시아는 언어 환경과 정부 정책이 지역마다 굉장히 달라요. 주로 수도가 있는 서쪽 서말레이시아와 보르네오 섬에 있는 동쪽 동말레이시아로 구분하는데 서말레이시아는 말레이어보다는 영어나 다른 언어를 많이 사용하고 동말레이시아에서 말레이어를 많이 사용해요. 제가 있는 곳은 동말레이시아의 사바주 코타키나발루 입니다. 이곳은 치안도 안정되어 있고 차를 타고 봉사할 수 있으니 다른 열대지역보다는 좀 더 적응하기 쉬운 것 같아요. 얼마전에 말레이어로 신세계역이 나와서 봉사와 집회 준비하는데 많은 도움이 됩니다. JW Library에서 성구들을 쉽게 찾아볼 수 있어요. 이곳의 많은 지역은 아직 한 번도 방문하지 않았다고 합니다. 많은 일꾼들이 필요한 곳이죠. 블로그 운영 계획 지금까지는 공개용 프로그램을 만들어서 필요한 분들에게 개인적으로 전달해 왔었는데 일일히 연락하고 업로드 하는 것이 쉽지 않아서 블로그에 올리려고 합니다. 직접 제작한 공개용 프로그램과 사용 문서 및 동영상이 주요 내용이겠네요. 먼저 한글 부터 시작해서 번역기의 힘을 빌려 영어, 중국어 정도는 올려보려고 합니다. 연락방법 궁금한 점 있으시면 댓글 달아주시면 확인 후 연락드립니다. 급한 연락은 Telegram(텔레그램)을 이용해주세요. 웹페이지에서 https://t.me/joyinput 으로 접속하시거나 텔레그램에서 아이디 @joyinput을 검색하시면 됩니다. 메일 주소는 joyinput@gmail.com입니다. 카톡아이디도 joyinput입니다.","categories":[],"tags":[{"name":"about","slug":"about","permalink":"http://jsoftdev.github.io/tags/about/"}]}]}